validation/piov/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Split-inlet channel for the pressureInletOutletVelocity test: flow enters the |
| UPPER half only (lower-half inlet is a wall), so a recirculation forms in the  |
| lower half and, with a short domain, reaches the outlet, giving BACKFLOW     |
| there. That exercises the directionMixed inflow branch (not just zeroGradient).|
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0   0)   //  0
    (1 0   0)   //  1
    (1 0.5 0)   //  2
    (0 0.5 0)   //  3
    (1 1   0)   //  4
    (0 1   0)   //  5
    (0 0   0.1) //  6
    (1 0   0.1) //  7
    (1 0.5 0.1) //  8
    (0 0.5 0.1) //  9
    (1 1   0.1) // 10
    (0 1   0.1) // 11
);

blocks
(
    hex (0 1 2 3 6 7 8 9)   (40 24 1) simpleGrading (1 1 1)   // lower half y[0,0.5]
    hex (3 2 4 5 9 8 10 11) (40 24 1) simpleGrading (1 1 1)   // upper half y[0.5,1]
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces ( (3 5 11 9) );          // upper-half left face
    }
    stepWall
    {
        type wall;
        faces ( (0 3 9 6) );           // lower-half left face (blocked)
    }
    outlet
    {
        type patch;
        faces ( (1 2 8 7) (2 4 10 8) );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 7 6)                  // bottom
            (5 4 10 11)                // top
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1) (3 5 4 2)        // z = 0
            (6 7 8 9) (9 8 10 11)      // z = 0.1
        );
    }
);

mergePatchPairs ();

// ************************************************************************* //
